USE BekoWarehouse;
GO

INSERT INTO Categories (category_name) VALUES
(N'Холодильники'),
(N'Стиральные машины');


INSERT INTO Warehouses (warehouse_name, address) VALUES
(N'Склад готовой продукции Beko',
N'Владимирская область, Киржачский район, д. Фёдоровское, ул. Сельская, д. 49'),

(N'Производственный склад комплектующих',
N'Владимирская область, Киржачский район, д. Фёдоровское, ул. Сельская, д. 50'),

(N'Резервный склад готовой продукции',
N'Владимирская область, Киржачский район, д. Фёдоровское');


INSERT INTO Employees (full_name, position, phone) VALUES
(N'Иванов Сергей Андреевич', N'Начальник склада', N'+7-900-111-22-33'),
(N'Петров Алексей Викторович', N'Старший кладовщик', N'+7-900-444-55-66'),
(N'Смирнова Анна Игоревна', N'Специалист по учёту продукции', N'+7-900-777-88-99'),
(N'Кузнецов Дмитрий Олегович', N'Кладовщик', N'+7-901-123-45-67'),
(N'Орлова Марина Сергеевна', N'Оператор складской системы', N'+7-901-234-56-78'),
(N'Фёдоров Максим Владимирович', N'Специалист по логистике', N'+7-901-345-67-89'),
(N'Волков Андрей Николаевич', N'Кладовщик готовой продукции', N'+7-902-456-78-90');


INSERT INTO Products (product_name, model, serial_number, manufacture_date, category_id) VALUES
(N'Холодильник Beko', N'B5RCNK403ZXBR', N'BK260701', '2026-04-10', 1),
(N'Холодильник Beko', N'RCNA406E40ZXBN', N'BK260702', '2026-04-12', 1),
(N'Холодильник Beko', N'CNMV5335EA0S', N'BK260703', '2026-04-15', 1),
(N'Стиральная машина Beko', N'WUE6512XWW', N'BK260704', '2026-04-18', 2),
(N'Стиральная машина Beko', N'WSPE7H616A', N'BK260705', '2026-04-20', 2),
(N'Стиральная машина Beko',N'WRE6512BWW','BK260706', '2026-04-22', 2);